; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	infrared3 - mode
	image0 - mode
	spectrograph2 - mode
	Star0 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation14 - direction
	GroundStation5 - direction
	GroundStation15 - direction
	Star24 - direction
	Star10 - direction
	GroundStation22 - direction
	Star4 - direction
	Star16 - direction
	Star18 - direction
	Star21 - direction
	Star29 - direction
	GroundStation9 - direction
	Star17 - direction
	Star13 - direction
	GroundStation12 - direction
	Star26 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation11 - direction
	GroundStation27 - direction
	Star1 - direction
	Star23 - direction
	GroundStation25 - direction
	GroundStation19 - direction
	Star20 - direction
	GroundStation28 - direction
	Phenomenon30 - direction
	Phenomenon31 - direction
	Phenomenon32 - direction
	Phenomenon33 - direction
	Planet34 - direction
	Planet35 - direction
	Star36 - direction
	Phenomenon37 - direction
	Planet38 - direction
	Phenomenon39 - direction
	Star40 - direction
	Phenomenon41 - direction
	Planet42 - direction
	Star43 - direction
	Planet44 - direction
	Planet45 - direction
	Phenomenon46 - direction
	Phenomenon47 - direction
	Planet48 - direction
	Phenomenon49 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star17)
	(calibration_target instrument0 Star16)
	(calibration_target instrument0 Star24)
	(calibration_target instrument0 GroundStation15)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star17)
	(calibration_target instrument1 Star18)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star26)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 GroundStation19)
	(calibration_target instrument1 GroundStation22)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star24)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation22)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation28)
	(calibration_target instrument2 GroundStation19)
	(calibration_target instrument2 GroundStation27)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star17)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star16)
	(supports instrument4 spectrograph2)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star18)
	(calibration_target instrument4 Star29)
	(calibration_target instrument4 Star20)
	(supports instrument5 image0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star26)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 Star17)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 Star29)
	(calibration_target instrument5 Star21)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation28)
	(calibration_target instrument6 Star20)
	(calibration_target instrument6 GroundStation19)
	(calibration_target instrument6 GroundStation25)
	(calibration_target instrument6 Star23)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 GroundStation27)
	(calibration_target instrument6 GroundStation11)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation22)
)
(:goal (and
	(pointing satellite0 Star16)
	(pointing satellite2 Star20)
	(have_image Phenomenon30 image0)
	(have_image Phenomenon31 image0)
	(have_image Phenomenon32 image0)
	(have_image Phenomenon33 thermograph1)
	(have_image Planet34 infrared3)
	(have_image Planet35 thermograph1)
	(have_image Star36 thermograph1)
	(have_image Phenomenon37 infrared3)
	(have_image Planet38 infrared3)
	(have_image Phenomenon39 spectrograph2)
	(have_image Star40 thermograph1)
	(have_image Phenomenon41 thermograph1)
	(have_image Planet42 image0)
	(have_image Star43 image0)
	(have_image Planet44 spectrograph2)
	(have_image Planet45 image0)
	(have_image Phenomenon46 spectrograph2)
	(have_image Phenomenon47 spectrograph2)
	(have_image Planet48 spectrograph2)
	(have_image Phenomenon49 spectrograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 22
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 22
3. (calibrate satellite0 instrument0 star24)
   added: (calibrated instrument0)
   goals met: 0 of 22
4. (turn_to satellite2 star20 groundstation22)
   deleted: (pointing satellite2 groundstation22)
   added: (pointing satellite2 star20)
   goals met: 1 of 22
5. (turn_to satellite1 phenomenon37 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon37)
   goals met: 1 of 22
6. (turn_to satellite0 phenomenon30 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 phenomenon30)
   goals met: 1 of 22
7. (take_image satellite0 phenomenon30 instrument0 image0)
   added: (have_image phenomenon30 image0)
   goals met: 2 of 22
8. (turn_to satellite0 phenomenon31 phenomenon30)
   deleted: (pointing satellite0 phenomenon30)
   added: (pointing satellite0 phenomenon31)
   goals met: 2 of 22
9. (take_image satellite0 phenomenon31 instrument0 image0)
   added: (have_image phenomenon31 image0)
   goals met: 3 of 22
10. (turn_to satellite0 phenomenon32 phenomenon31)
   deleted: (pointing satellite0 phenomenon31)
   added: (pointing satellite0 phenomenon32)
   goals met: 3 of 22
11. (take_image satellite0 phenomenon32 instrument0 image0)
   added: (have_image phenomenon32 image0)
   goals met: 4 of 22
12. (turn_to satellite0 phenomenon33 phenomenon32)
   deleted: (pointing satellite0 phenomenon32)
   added: (pointing satellite0 phenomenon33)
   goals met: 4 of 22
13. (take_image satellite0 phenomenon33 instrument0 thermograph1)
   added: (have_image phenomenon33 thermograph1)
   goals met: 5 of 22
14. (turn_to satellite0 phenomenon39 phenomenon33)
   deleted: (pointing satellite0 phenomenon33)
   added: (pointing satellite0 phenomenon39)
   goals met: 5 of 22
15. (take_image satellite0 phenomenon39 instrument0 spectrograph2)
   added: (have_image phenomenon39 spectrograph2)
   goals met: 6 of 22
16. (turn_to satellite0 phenomenon41 phenomenon39)
   deleted: (pointing satellite0 phenomenon39)
   added: (pointing satellite0 phenomenon41)
   goals met: 6 of 22
17. (take_image satellite0 phenomenon41 instrument0 thermograph1)
   added: (have_image phenomenon41 thermograph1)
   goals met: 7 of 22
18. (turn_to satellite0 phenomenon46 phenomenon41)
   deleted: (pointing satellite0 phenomenon41)
   added: (pointing satellite0 phenomenon46)
   goals met: 7 of 22
19. (take_image satellite0 phenomenon46 instrument0 spectrograph2)
   added: (have_image phenomenon46 spectrograph2)
   goals met: 8 of 22
20. (turn_to satellite0 phenomenon47 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon47)
   goals met: 8 of 22
21. (take_image satellite0 phenomenon47 instrument0 spectrograph2)
   added: (have_image phenomenon47 spectrograph2)
   goals met: 9 of 22
22. (turn_to satellite0 phenomenon49 phenomenon47)
   deleted: (pointing satellite0 phenomenon47)
   added: (pointing satellite0 phenomenon49)
   goals met: 9 of 22
23. (take_image satellite0 phenomenon49 instrument0 spectrograph2)
   added: (have_image phenomenon49 spectrograph2)
   goals met: 10 of 22
24. (turn_to satellite0 planet35 phenomenon49)
   deleted: (pointing satellite0 phenomenon49)
   added: (pointing satellite0 planet35)
   goals met: 10 of 22
25. (take_image satellite0 planet35 instrument0 thermograph1)
   added: (have_image planet35 thermograph1)
   goals met: 11 of 22
26. (turn_to satellite0 planet42 planet35)
   deleted: (pointing satellite0 planet35)
   added: (pointing satellite0 planet42)
   goals met: 11 of 22
27. (take_image satellite0 planet42 instrument0 image0)
   added: (have_image planet42 image0)
   goals met: 12 of 22
28. (turn_to satellite0 planet44 planet42)
   deleted: (pointing satellite0 planet42)
   added: (pointing satellite0 planet44)
   goals met: 12 of 22
29. (take_image satellite0 planet44 instrument0 spectrograph2)
   added: (have_image planet44 spectrograph2)
   goals met: 13 of 22
30. (turn_to satellite0 planet45 planet44)
   deleted: (pointing satellite0 planet44)
   added: (pointing satellite0 planet45)
   goals met: 13 of 22
31. (take_image satellite0 planet45 instrument0 image0)
   added: (have_image planet45 image0)
   goals met: 14 of 22
32. (turn_to satellite0 planet48 planet45)
   deleted: (pointing satellite0 planet45)
   added: (pointing satellite0 planet48)
   goals met: 14 of 22
33. (take_image satellite0 planet48 instrument0 spectrograph2)
   added: (have_image planet48 spectrograph2)
   goals met: 15 of 22
34. (turn_to satellite0 star16 planet48)
   deleted: (pointing satellite0 planet48)
   added: (pointing satellite0 star16)
   goals met: 16 of 22
35. (turn_to satellite1 star4 phenomenon37)
   deleted: (pointing satellite1 phenomenon37)
   added: (pointing satellite1 star4)
   goals met: 16 of 22
36. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 16 of 22
37. (turn_to satellite1 phenomenon37 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon37)
   goals met: 16 of 22
38. (take_image satellite1 phenomenon37 instrument2 infrared3)
   added: (have_image phenomenon37 infrared3)
   goals met: 17 of 22
39. (turn_to satellite1 planet34 phenomenon37)
   deleted: (pointing satellite1 phenomenon37)
   added: (pointing satellite1 planet34)
   goals met: 17 of 22
40. (take_image satellite1 planet34 instrument2 infrared3)
   added: (have_image planet34 infrared3)
   goals met: 18 of 22
41. (turn_to satellite1 planet38 planet34)
   deleted: (pointing satellite1 planet34)
   added: (pointing satellite1 planet38)
   goals met: 18 of 22
42. (take_image satellite1 planet38 instrument2 infrared3)
   added: (have_image planet38 infrared3)
   goals met: 19 of 22
43. (turn_to satellite0 star36 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star36)
   goals met: 18 of 22
44. (take_image satellite0 star36 instrument0 thermograph1)
   added: (have_image star36 thermograph1)
   goals met: 19 of 22
45. (turn_to satellite0 star16 star36)
   deleted: (pointing satellite0 star36)
   added: (pointing satellite0 star16)
   goals met: 20 of 22
46. (turn_to satellite0 star40 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star40)
   goals met: 19 of 22
47. (take_image satellite0 star40 instrument0 thermograph1)
   added: (have_image star40 thermograph1)
   goals met: 20 of 22
48. (turn_to satellite0 star16 star40)
   deleted: (pointing satellite0 star40)
   added: (pointing satellite0 star16)
   goals met: 21 of 22
49. (turn_to satellite0 star43 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star43)
   goals met: 20 of 22
50. (take_image satellite0 star43 instrument0 image0)
   added: (have_image star43 image0)
   goals met: 21 of 22
51. (turn_to satellite0 star16 star43)
   deleted: (pointing satellite0 star43)
   added: (pointing satellite0 star16)
   goals met: 22 of 22
